In [1]:
import sqlite3
import pandas as pd
from sqlite3 import connect

In [2]:
DB_PATH = 'c:\\Users\\karac\\OneDrive\\바탕 화면\\bigdata\\test.sqlite'

In [3]:
with connect(DB_PATH) as db:
    db.execute("""
    CREATE TABLE IF NOT EXISTS Orders (
               order_id INT,
               item VARCHAR(40),
               amount INT,
               customer_id INT REFERENCES Customers(id),
               CONSTRAINT OrderPK PRIMARY KEY (order_id)
            )   
    """)

In [4]:
with connect(DB_PATH) as pd:
    db.execute("""
    CREATE TABLE IF NOT EXISTS Customers (
               id INT,
               last_name VARCHAR(40),
               first_name VARCHAR(40),
               age INT,
               country VARCHAR(10),
               CONSTRAINT CustomerPK PRIMARY KEY (id) 
            )
    """)

In [5]:
## 테이블 확인
import pandas as pd

conn = sqlite3.connect(DB_PATH)
cursor = conn.cursor()
table = pd.read_sql_query("SELECT name FROM sqlite_master WHERE type='table'", conn)
print(table)

        name
0     Orders
1  Customers

In [6]:
## table 형식으로 확인
table = pd.read_sql_query("SELECT * from Orders", conn)
table.head()

Empty DataFrame
Columns: [order_id, item, amount, customer_id]
Index: []

In [7]:
## table 형식으로 확인
table = pd.read_sql_query("SELECT * from Customers", conn)
table.head()

Empty DataFrame
Columns: [id, last_name, first_name, age, country]
Index: []

In [8]:
## insert
INSERT_SQL = 'INSERT INTO Orders(order_id, item, amount, customer_id) VALUES (?, ?, ?, ?);'

# 여러 개 데이터 한 번에 추가하기
data = (
    (1, '공책', 500, 5),
    (2, '펜', 10, 2),
    (3, '마커', 120, 3),
    (4, '책', 1000, 1),
    (5, '지우개', 20, 4)
)

# 여러 개 값 추가
cursor.executemany(INSERT_SQL, data)

# 한 개의 값만 추가
# cursor.execute(INSERT_SQL, (6, '형광펜', 700, 6))

# commit을 꼭 해주어야 데이터베이스에 반영된다
conn.commit()

# 데이터 확인
cursor.execute('SELECT * FROM Orders')
item_list = cursor.fetchall()
for i in item_list:
    print(i)

(1, '공책', 500, 5)
(2, '펜', 10, 2)
(3, '마커', 120, 3)
(4, '책', 1000, 1)
(5, '지우개', 20, 4)

In [9]:
## insert
INSERT_SQL = 'INSERT INTO Customers(id, last_name, first_name, age, country) VALUES (?, ?, ?, ?, ?);'

# 여러 개 데이터 한 번에 추가하기
data = (
    (1, '홍', '길동', 31, '한국'),
    (2, 'Luna', 'Robert', 10, '미국'),
    (3, 'Kim', 'Monica', 35, '러시아'),
    (4, '모리', '나나세', 59, '일본'),
    (5, 'Doe', 'Betty', 20, '영국'),
)

# 여러 개 값 추가
cursor.executemany(INSERT_SQL, data)

# 한 개의 값만 추가
# cursor.execute(INSERT_SQL, (6, '형광펜', 700, 6))

# commit을 꼭 해주어야 데이터베이스에 반영된다
conn.commit()

# 데이터 확인
cursor.execute('SELECT * FROM Customers')
item_list = cursor.fetchall()
for i in item_list:
    print(i)

(1, '홍', '길동', 31, '한국')
(2, 'Luna', 'Robert', 10, '미국')
(3, 'Kim', 'Monica', 35, '러시아')
(4, '모리', '나나세', 59, '일본')
(5, 'Doe', 'Betty', 20, '영국')

In [10]:
table = pd.read_sql_query("SELECT * FROM Orders", conn)
table.head()

   order_id item  amount  customer_id
0         1   공책     500            5
1         2    펜      10            2
2         3   마커     120            3
3         4    책    1000            1
4         5  지우개      20            4

In [11]:
table = pd.read_sql_query("SELECT * FROM Customers", conn)
table.head()

   id last_name first_name  age country
0   1         홍         길동   31      한국
1   2      Luna     Robert   10      미국
2   3       Kim     Monica   35     러시아
3   4        모리        나나세   59      일본
4   5       Doe      Betty   20      영국

In [13]:
## 김모니카의 구매내역을 보기 위해서는?
q = """SELECT * FROM Orders where customer_id = 3"""

pd.read_sql_query(q, conn)

   order_id item  amount  customer_id
0         3   마커     120            3

In [14]:
## 김모니카의 정보를 보기 위해서는?
q = """SELECT * FROM Customers where id = 3"""

pd.read_sql_query(q, conn)

   id last_name first_name  age country
0   3       Kim     Monica   35     러시아

In [15]:
## 김모니카 정보 UPDATE
UPDATE_SQL = 'UPDATE Customers SET country = "카자흐스탄" WHERE first_name = "Monica";'
cursor.execute(UPDATE_SQL)

conn.commit()

#확인
cursor.execute('SELECT * FROM Customers WHERE first_name = "Monica";')
updated_customer = cursor.fetchall()
print(updated_customer)

[(3, 'Kim', 'Monica', 35, '카자흐스탄')]